[
  {
    "path": "posts/2021-11-18-calenviroscreen/",
    "title": "From 2013 - 2021, California census tracts with higher poverty rates demonstrate worse air quality",
    "description": "EDS 222: Statistics for Environmental Data Science",
    "author": [
      {
        "name": "Mia Forsline",
        "url": {}
      }
    ],
    "date": "2021-12-02",
    "categories": [],
    "contents": "\n\nContents\nResearch Question\nIntroduction\nStatistical Hypotheses\nData Description and Collection\n1. PM2.5\n2. Poverty\n\nMethods - Statistical Analysis Plan\nResults\nConclusion\nFuture Directions\nGitHub\n\nResearch Question\nFrom 2013 to 2021, does air quality (as measured by annual mean PM2.5 concentrations per census tract) vary with poverty rates (as measured by the percent of the population living below two times the federal poverty level per census tract) in California?\nIntroduction\nIn California, events like wildfires can greatly reduce air quality by releasing fine particles called particulate matter, or PM2.5 (Shi et al., 2019). PM2.5 refers to particles with diameters ≤ 2.5 µm, which are known to be hazardous for human health. PM2.5 is especially detrimental for human respiratory and cardiovascular health (Cleland et al., 2021). As California’s wildfires continue to worsen over time, it is becoming increasingly important to monitor air quality, PM2.5 concentrations, and their impacts on populations (Gupta et al., 2018).\nHowever, the environmental burden of poor air quality is not shared equally. For example, the San Joaquin Valley’s economically disadvantaged and ethnically diverse communities breathe some of the most polluted air in the nation (Cisneros et al., 2017). As a result, vulnerable communities such as Mexican American immigrant farm workers and their families experience disproportionately high rates of asthma attacks, hospital admissions, and other medical issues (Schwartz & Pepper, 2009). This inequitable pattern repeats itself in other states (Qian & Wu, 2019), the United States overall (Tessum et al., 2021), and even other countries (Li et al., 2018).\nWhile there are many possible ways to explore the inequity of air pollution in California, I specifically use annual mean PM2.5 to measure of air quality and poverty rate to quantify socioeconomic disparities. I expect to find a significant relationship between these two variables.\nStatistical Hypotheses\nMy null hypothesis (\\(H_0\\)) is that, in California, there is no relationship between annual mean PM2.5 concentrations per census tract and percent of the population living below twice the federal poverty line per census tract.\nMy alternative hypothesis (\\(H_A\\)) is that, in California, there is a relationship between annual mean PM2.5 concentrations per census tract and percent of the population living below twice the federal poverty line per census tract.\nData Description and Collection\n\n\nshow\n\nknitr::opts_chunk$set(echo = FALSE,\n                      message = FALSE, \n                      warning = FALSE, \n                      include = TRUE)\n#turn off scientific notation and select how many digits to round outputs to \noptions(\"scipen\" = 999, \"digits\" = 4)\n\n#import necessary libraries \nlibrary(tidyverse)\nlibrary(here)\nlibrary(gt)\nlibrary(xtable)\nlibrary(kableExtra)\n\n\n\n\n\nshow\n\n#read in data\nc1 <- read_csv(file = here(\"_posts\", \n                           \"2021-11-18-calenviroscreen\", \n                           \"CES\", \n                           \"CES_data\", \n                           \"ces1_2013.csv\"))\nc2 <- read_csv(file = here(\"_posts\", \n                           \"2021-11-18-calenviroscreen\", \n                           \"CES\", \n                           \"CES_data\", \n                           \"ces2_2014.csv\"))\nc3 <- read_csv(file = here(\"_posts\", \n                           \"2021-11-18-calenviroscreen\", \n                           \"CES\", \n                           \"CES_data\", \n                           \"ces3_2018.csv\"))\nc4 <- read_csv(file = here(\"_posts\", \n                           \"2021-11-18-calenviroscreen\", \n                           \"CES\", \n                           \"CES_data\", \n                           \"ces4_2021.csv\"))\n#clean data\n##select and rename necessary columns \n##add Year column \nc1_clean <- c1 %>% \n  select(c(\"ZIP Code\",\"Poverty\", \"PM2.5\")) %>% \n  mutate(Year = \"2013\") %>% \n  dplyr::rename(ZIP = \"ZIP Code\") %>% \n  mutate(ZIP = as.numeric(ZIP))\nc2_clean <- c2 %>% \n  select(c(\"Census Tract\", \"California County\", \"ZIP\", \"Longitude\", \"Latitude\", \"Poverty\", \"PM2.5\")) %>% \n  mutate(Year = \"2014\",\n         ZIP = as.numeric(ZIP))\nc3_clean <- c3 %>% \n  select(c(\"Census Tract\", \"California County\", \"ZIP\", \"Longitude\", \"Latitude\", \"Poverty\", \"PM2.5\")) %>% \n  mutate(Year = \"2018\",\n         ZIP = as.numeric(ZIP))\nc4_clean <- c4 %>% \n  select(c(\"Census Tract\", \"California County\", \"ZIP\", \"Longitude\", \"Latitude\", \"Poverty\", \"PM2.5\")) %>% \n  mutate(Year = \"2021\",\n         ZIP = as.numeric(ZIP))\n\n\n\n\n\nshow\n\n#fill in missing column data for c1 dataset so all datasets have the same columns \nc1_fill <- full_join(x = c2_clean, y = c1_clean, \n                     by = \"ZIP\", \n                     suffix = c(\".c2\", \".c1\")) %>%\n  select(c(\"Census Tract\", \n           \"California County\", \n           \"ZIP\", \n           \"Longitude\", \n           \"Latitude\", \n           \"Poverty.c1\", \n           \"PM2.5.c1\", \n           \"Year.c1\")) %>%\n  dplyr::rename(Poverty = \"Poverty.c1\",\n                PM2.5 = \"PM2.5.c1\",\n                Year = \"Year.c1\")\n\n\n\n\n\nshow\n\n#rbind datasets to create a single combined dataset with all 4 years of CalEnviroScreen data\njoined <- rbind(c4_clean, c3_clean, c2_clean, c1_fill) %>% \n  mutate(Year = as.factor(Year),\n         Year = factor(x = Year, levels = c(\"2013\", \"2014\", \"2018\", \"2021\"))) %>% \n  drop_na(Year) \n\n\n\nI downloaded 2013 - 2021 CalEnviroScreen (CES) data from the California Office of Environmental Health Hazard Assessment (OEHHA) and the California Open Data Portal:\nVersions 1.1 (Sept 2013)\nVersions 2.0 (Oct 2014)\nVersions 3.0 (June 2018)\nVersions 4.0 (Oct 2021)\nEach data set contains columns of environmental pollution burden indicators, including PM2.5, and population characteristics, including rates of poverty. Each census tract in California is represented as a row and assigned a value per environmental indicator and population characteristic. One thing to note is that due to developing technology over time, earlier data have different sample sizes and sampling techniques compared to newer data, which can complicate how we compare the data across time.\nOut of the myriad components of the CES data, I am interested in:\n1. PM2.5\nThe annual mean concentration of PM2.5 is a weighted average of measured monitor concentrations and satellite observations (ug/m3) over 3 years to avoid account for uneven sampling frequency. For example, the CES 1.1. report used data from 2007 - 2009 while the CES 4.0 report used 2015 - 2017. All reports used data from the California Air Resources Board’s Air Monitoring Network (AMN), while CES 3.0 and CES 4.0 also incorporated Satellite Remote Sensing Data.\nData were more likely to be high resolution around certain cities or localized areas, and not all cities had air monitoring stations. Locales with little to no data were either omitted or estimated using nearby locations’ data. For example, in CES 1.1, census tracts with centers > 50km away from the nearest air monitor were omitted. In CES 4.0, missing data was estimated using regression relationships with nearby sites.\nFor CES 1.1 - 3.0, the quarterly mean PM2.5 concentrations were estimated using ordinary kriging. For CES 4.0, overall PM2.5 annual mean concentrations were estimated for the center of each 1km x 1km grid cell using both the monitoring and satellite data in a weighted average. An inverse-distance weighting method was used, so grid cells close to monitors relied more heavily on monitor estimates while grid cells further from monitors relied more heavily on satellite data. Grid cells with monitors > 50km away relied solely on satellite data.\nThe quarterly estimates were then averaged to calculate annual means (Figure 1).\n\n\nshow\n\nggplot(data = joined, aes(x = PM2.5)) + \n  geom_histogram(aes(fill = Year), binwidth = 1) + \n  theme_classic() + \n  facet_wrap(~Year, ncol = 2) + \n  labs(x = expression(paste(\"Mean PM2.5 per census tract (µg/m\"^3~\")\")),\n       y = \"Frequency\") + \n  theme(legend.position = \"none\")\n\n\n\n\nFigure 1: 2013 - 2021 mean PM2.5 in California was not normally distributed. In 2013 (n = 8,151), 2014 (n = 7,847), 2018 (n = 7,938), and 2021 (n = 7,960), the annual mean concentrations of PM2.5 (µg/m3) per census tract were 11.52, 10.01, 10.38, and 10.15 respectively. Data was sourced from CalEnviroScreen 1.1 - 4.0 (https://oehha.ca.gov/).\n\n\n\n2. Poverty\nThe percent of the population living below two times the federal poverty level was calculated using a 5-year estimate to produce more reliable results for geographic areas with small populations. For example, the CES 1.1 report used a 5-year estimate from 2007 - 2011 data while the CES 4.0 report used a 5-year estimate from 2015 - 2019 data. Poverty data came from the American Community Survey.\nCES defined poverty as twice below the federal poverty line to account for California’s high cost of living relative to other states and because the federal poverty threshold has not changed since the 1980s despite the cost of living increasing over time. The percent per census tract was calculated by individuals living below 200% the poverty level per census tract / total individuals living below 200% of the poverty level (Figure 2). Standard error was calculated to determine the reliability of the calculated poverty rate. Census tracts with unreliable estimates were assigned no value for poverty rate.\n\n\nshow\n\nggplot(data = joined, aes(x = Poverty)) + \n  geom_histogram(aes(fill = Year), binwidth = 5) + \n  theme_classic() + \n  facet_wrap(~Year, ncol = 2) + \n  labs(x = \"Poverty rate per census tract (%)\", \n       y = \"Frequency\")\n\n\n\n\nFigure 2: 2013 - 2021 poverty rates in California were not normally distributed. In 2013 (n = 8,151), 2014 (n = 7,847), 2018 (n = 7,938), and 2021 (n = 7,960), the mean percentages of the population per census tract living below two times the federal poverty level were 34.24%, 35.28%, 36.39%, and 31.34% respectively. Data was sourced from CalEnviroScreen 1.1 - 4.0 (https://oehha.ca.gov/).\n\n\n\nMethods - Statistical Analysis Plan\nTo assess if, in California from 2013 - 2021, air quality varied with poverty rates, I ran a linear regression of PM2.5 ~ Poverty for each year (e.g., 2013, 2014, 2018, 2021). This analysis is appropriate to describe how air quality might be changing with respect to poverty rates. Running multiple regressions over different years can help determine how this relationship could be changing over time.\nThis method is limited by the fact that I am only including one independent variable (Poverty) in the model. In other words, this analysis is vulnerable to omitted variables bias because it is likely that there are many different factors in addition to poverty that influence air quality. Nevertheless, this is a solid starting point for unraveling those complex relationships.\nResults\n\n\nshow\n\nmod1 <- lm(PM2.5 ~ Poverty, data = c1)\nsum1 <- summary(mod1)\n\nmod2 <- lm(PM2.5 ~ Poverty, data = c2)\nsum2 <- summary(mod2)\n\nmod3 <- lm(PM2.5 ~ Poverty, data = c3)\nsum3 <- summary(mod3)\n\nmod4 <- lm(PM2.5 ~ Poverty, data = c4)\nsum4 <- summary(mod4)\n\n\n\nFor all time periods, annual mean PM2.5 concentrations were significantly influenced by the poverty rate (Figure 3). In 2013, PM2.5 increased by 0.0352 µg/m3 as the poverty rate increased by 1% (p-value < 0.001, sd = 0.0044). In 2014, PM2.5 increased by 0.0279 µg/m3 as the poverty rate increased by 1% (p-value < 0.001, sd = 0.0014). In 2018, PM2.5 increased by 0.0299 µg/m3 as the poverty rate increased by 1% (p-value < 0.001, sd = 0.0014). In 2021, PM2.5 increased by 0.0286 µg/m3 as the poverty rate increased by 1% (p-value < 0.001, sd = 0.0013). These results support my hypothesis that mean PM2.5 and poverty in California are positively related.\nOver time, the relationship between mean PM2.5 and poverty rate has remained fairly stable with the slope only varying from 0.0279 to 0.0352.\n\n\nshow\n\njoined <- joined %>% \n  drop_na(Poverty, PM2.5)\n\nggplot(data = joined, aes(x = Poverty, y = PM2.5)) +\n  geom_point(aes(color = Year), alpha = 0.05) + \n  geom_smooth(method='lm', \n              formula= y~x,\n              size=1, \n              color = \"black\") + \n  theme_classic()+ \n  labs(x = \"Poverty rate (%)\",\n       y = expression(paste\n                       (\"Mean PM2.5 (µg/m\"^3~\")\"))) +\n  facet_wrap(.~Year, ncol = 2) + \n  theme(legend.position = \"none\")\n\n\n\n\nFigure 3: Air quality significantly associates poverty in California. In 2013 (n = 8,151), 2014 (n = 7,847), 2018 (n = 7,938), and 2021 (n = 7,960), as poverty rates increase in California, mean PM2.5 increases and air quality deteriorates (p-value <<< 0.001).\n\n\n\nConclusion\nAs expected, I found a statistically significant relationship between air quality and poverty rates in California during 2013, 2014, 2018, and 2021. For all four years, annual mean concentrations of PM2.5 (µg/m3) increased as the percent of people living below twice the federal poverty level increased (Figure 3). In other words, air quality was on average lower in census tracts with higher poverty rates. These findings supported my hypothesis and corroborated prior research that has identified PM2.5 disparities based on socioeconomic factors in California (Mousavi et al., 2021). This analysis also emphasizes the importance of an environmental justice lens when investigating issues such as air quality.\nFuture Directions\nWhile my analysis focused on four specific years of comprehensive CalEnviroScreen data, it would be interesting to expand the time frame to before 2013 because 2013 is when California’s cap-and-trade program was initiated. During this time, there is evidence that while overall greenhouse gases were reduced in California, socioeconomically disadvantaged communities actually experienced emission increases (Cushing et al., 2018).\nGitHub\nThe full code can be accessed here.\n\n\n\nCisneros, R., Brown, P., Cameron, L., Gaab, E., Gonzalez, M., Ramondt, S., Veloz, D., Song, A., & Schweizer, D. (2017). Understanding Public Views about Air Quality and Air Pollution Sources in the San Joaquin Valley, California. Journal of Environmental and Public Health, 2017, e4535142. https://doi.org/10.1155/2017/4535142\n\n\nCleland, S. E., Serre, M. L., Rappold, A. G., & West, J. J. (2021). Estimating the Acute Health Impacts of Fire-Originated PM2.5 Exposure During the 2017 California Wildfires: Sensitivity to Choices of Inputs. GeoHealth, 5(7), e2021GH000414. https://doi.org/10.1029/2021GH000414\n\n\nCushing, L., Blaustein-Rejto, D., Wander, M., Pastor, M., Sadd, J., Zhu, A., & Morello-Frosch, R. (2018). Carbon trading, co-pollutants, and environmental equity: Evidence from California’s cap-and-trade program (20112015). PLOS Medicine, 15(7), e1002604. https://doi.org/10.1371/journal.pmed.1002604\n\n\nGupta, P., Doraiswamy, P., Levy, R., Pikelnaya, O., Maibach, J., Feenstra, B., Polidori, A., Kiros, F., & Mills, K. C. (2018). Impact of California Fires on Local and Regional Air Quality: The Role of a Low-Cost Sensor Network and Satellite Observations. GeoHealth, 2(6), 172–181. https://doi.org/10.1029/2018GH000136\n\n\nLi, V. O., Han, Y., Lam, J. C., Zhu, Y., & Bacon-Shone, J. (2018). Air pollution and environmental injustice: Are the socially deprived exposed to more PM2.5 pollution in Hong Kong? Environmental Science & Policy, 80, 53–61. https://doi.org/10.1016/j.envsci.2017.10.014\n\n\nMousavi, A., Yuan, Y., Masri, S., Barta, G., & Wu, J. (2021). Impact of 4th of July Fireworks on Spatiotemporal PM2.5 Concentrations in California Based on the PurpleAir Sensor Network: Implications for Policy and Environmental Justice. International Journal of Environmental Research and Public Health, 18(11), 5735. https://doi.org/10.3390/ijerph18115735\n\n\nQian, X., & Wu, Y. (2019). Assessment for health equity of PM2.5 exposure in bikeshare systems: The case of Divvy in Chicago. Journal of Transport & Health, 14, 100596. https://doi.org/10.1016/j.jth.2019.100596\n\n\nSchwartz, N. A., & Pepper, D. (2009). Childhood Asthma, Air Quality, and Social Suffering Among Mexican Americans in California’s San Joaquin Valley: “Nobody Talks to Us Here”. Medical Anthropology, 28(4), 336–367. https://doi.org/10.1080/01459740903303944\n\n\nShi, H., Jiang, Z., Zhao, B., Li, Z., Chen, Y., Gu, Y., Jiang, J. H., Lee, M., Liou, K.-N., Neu, J. L., Payne, V. H., Su, H., Wang, Y., Witek, M., & Worden, J. (2019). Modeling Study of the Air Quality Impact of Record-Breaking Southern California Wildfires in December 2017. Journal of Geophysical Research: Atmospheres, 124(12), 6554–6570. https://doi.org/10.1029/2019JD030472\n\n\nTessum, C. W., Paolella, D. A., Chambliss, S. E., Apte, J. S., Hill, J. D., & Marshall, J. D. (2021). PM 2.5 polluters disproportionately and systemically affect people of color in the United States. Science Advances, 7(18), eabf4491. https://doi.org/10.1126/sciadv.abf4491\n\n\n\n\n",
    "preview": "posts/2021-11-18-calenviroscreen/logo.png",
    "last_modified": "2021-12-05T09:53:19-08:00",
    "input_file": {},
    "preview_width": 400,
    "preview_height": 300
  },
  {
    "path": "posts/2021-10-24-eds223houston/",
    "title": "Spatial analysis of 2020 Houston power outages due to extreme winter storms",
    "description": "EDS 223: Spatial Analysis - Assignment 2",
    "author": [
      {
        "name": "Mia Forsline",
        "url": {}
      }
    ],
    "date": "2021-10-24",
    "categories": [],
    "contents": "\n\nContents\nLearning objectives\nIntroduction\nLoad necessary packages\nLoad and explore data\nDefine a function to load the DNB dataset from VNP46A1 granules\nInvoke the function to read in all 4 datasets\nCombine the data into 2 datasets\nCreate exploratory plots for night lights intensity before and after the storm\n\nCreate a blackout mask\nVectorize the mask and fix invalid geometries\nCrop the vectorized map to our ROI\n\nRead in roads Data\nRead in buildings data\nRead in census tract data\nMerge the datasets\nQuestion 1: How many residential buildings were without power on 2021-02-16?\nVisualize buildings where the blackout occurred\n\nConclusion\nGitHub\n\nLearning objectives\nLoad vector data\nLoad raster data\nSimple raster operations\nSimple geoprocessing / vector operations\nSpatial joins\nIntegrating SQL into an RMD\nIntroduction\nDuring February 2021, Texas experienced three extreme winter storms on February 10-11, February 13-17, and Februrary 15-20 that caused power outages in Houston’s residential areas. We are interested in quantifying the severity of those power outages by calculating the number of Houston homes that lost power due to the first two storms.\nTo do so, we are used NASA’s VNP46A1 data product from the Visible Infrared Imaging Radiometer Suite (VIIRS) to examine night lights image data from February 7-16. We used four VIIRS data tiles to study the Houston area.\nWe also incorporated OpenStreetMap roads and building data to account for light emitted from traffic and buildings.\nWe defined an area as having experienced a blackout if we calculate a difference in night lights intensity greater than 200 nW cm-2 sr-1.\nLoad necessary packages\n\n\nshow\n\nlibrary(sf)\nlibrary(stringr)\nlibrary(stars)\nlibrary(rgdal)\nlibrary(dplyr)\nlibrary(tmap)\nlibrary(lintr)\nlibrary(rosm)\n\n\n\nLoad and explore data\nDefine a function to load the DNB dataset from VNP46A1 granules\n\n\nshow\n\nread_dnb <- function(file_name) {\n\n  dataset_name <- \"//HDFEOS/GRIDS/VNP_Grid_DNB/Data_Fields/DNB_At_Sensor_Radiance_500m\"\n\n  h_string <- gdal_metadata(file_name)[199]\n  v_string <- gdal_metadata(file_name)[219]\n\n  tile_h <- as.integer(str_split(h_string, \"=\", simplify = TRUE)[[2]])\n  tile_v <- as.integer(str_split(v_string, \"=\", simplify = TRUE)[[2]])\n\n  west <- (10 * tile_h) - 180\n  north <- 90 - (10 * tile_v)\n  east <- west + 10\n  south <- north - 10\n\n  delta <- 10 / 2400\n\n  dnb <- read_stars(file_name, sub = dataset_name, quiet = TRUE)\n\n  st_crs(dnb) <- st_crs(4326)\n  st_dimensions(dnb)$x$delta <- delta\n  st_dimensions(dnb)$x$offset <- west\n  st_dimensions(dnb)$y$delta <- -delta\n  st_dimensions(dnb)$y$offset <- north\n\n  return(dnb)\n}\n\n\n\nInvoke the function to read in all 4 datasets\n\n\nshow\n\nfile_name <- \"data/VNP46A1.A2021038.h08v05.001.2021039064328.h5\"\ndnb_38_v05 <- read_dnb(file_name = file_name)\n\nfile_name <- \"data/VNP46A1.A2021038.h08v06.001.2021039064329.h5\"\ndnb_38_v06 <- read_dnb(file_name = file_name)\n\nfile_name <- \"data/VNP46A1.A2021047.h08v05.001.2021048091106.h5\"\ndnb_47_v05 <- read_dnb(file_name = file_name)\n\nfile_name <- \"data/VNP46A1.A2021047.h08v06.001.2021048091105.h5\"\ndnb_47_v06 <- read_dnb(file_name = file_name)\n\n\n\nCombine the data into 2 datasets\ndnb_38 is data from before the storm\ndnb_47 is data from after the storm\n\n\nshow\n\nx1 <- dnb_38_v05\nx2 <- dnb_38_v06\ndnb_38 <- st_mosaic(x1, x2)\n\nx3 <- dnb_47_v05\nx4 <- dnb_47_v06\ndnb_47 <- st_mosaic(x3, x4)\n\n\n\nCreate exploratory plots for night lights intensity before and after the storm\nNote: This is a crude data analysis of the “DNB_At_Sensor_Radiance_500m” dataset, which contains values as seen from space. There is no correction for stray light, moonshine, cloud presence, or any other confounding variables As a result, it is possible we have surprising outliers and regions that systemically actually appear to be brighter from space after the storm.\n\n\nshow\n\nplot(dnb_38,\n     ylim = c(29, 30.5),\n     xlim = c(-94.5, -96.5),\n     breaks = seq(0, 2000, length.out = 1000))\n\n\ndownsample set to c(9,9)\n\n\nFigure 1: Night lights intensity in Houston, TX before the storm.\n\n\n\n\n\nshow\n\nplot(dnb_47,\n     ylim = c(29, 30.5),\n     xlim = c(-94.5, -96.5),\n     breaks = seq(0, 2000, length.out = 1000))\n\n\ndownsample set to c(9,9)\n\n\nFigure 2: Night lights intensity in Houston, TX after the storm.\n\n\n\nCreate a blackout mask\nTo find the difference, we subtract night lights intensity after the storm (which is less bright) from night lights intensity before the storm (which is brighter)\nNext, we mark all observations that did not experience a blackout as NA\n\n\nshow\n\ndifference <- (dnb_38 - dnb_47) > 200\ndifference[difference == FALSE] <- NA\n\n\n\nVectorize the mask and fix invalid geometries\n\n\nshow\n\ndiff_vector <- st_as_sf(difference)\ndiff_vector <- st_make_valid(diff_vector)\n\n\n\nCrop the vectorized map to our ROI\nCreate a bounding box for the Houston area\nConvert the bounding box to a sf\nProject the bounding box to WGS 84\nCrop the vectorized map to the Houston bounding box\nProject the cropped, vectorized map to NAD 83\n\n\nshow\n\nhouston <- st_polygon(list(rbind(c(-96.5, 29),\n                                 c(-96.5, 30.5),\n                                 c(-94.5, 30.5),\n                                 c(-94.5, 29),\n                                 c(-96.5, 29))))\nhouston <- st_sfc(houston)\nhouston <- houston %>%\n  st_set_crs(4326)\n\ndiff_cropped <- diff_vector[houston, op = st_intersects]\ndiff_cropped <- diff_cropped %>%\n  st_transform(3083)\n\n\n\nRead in roads Data\nUse SQL to read in the highways data\nProject highways to NAD 83\nCreate and dissolve 200m buffers around the highways\n\n\nshow\n\nquery <- \"SELECT * FROM gis_osm_roads_free_1 WHERE fclass='motorway'\"\nhighways <- st_read(\"data/gis_osm_roads_free_1.gpkg\", query = query, quiet = TRUE)\nhighways <- highways %>%\n  st_transform(3083)\n\nhwy_buff_200m  <- st_buffer(highways, dist =  200)\nhwy_buff_200m <- st_union(hwy_buff_200m)\n\n\n\nRead in buildings data\nUse SQL to read in the buildings data\nProject buildings to NAD 83\nNote: buildings contains residential, apartments, house, static_caravan, and detached types\n\n\nshow\n\nquery <- \"SELECT *\nFROM gis_osm_buildings_a_free_1\nWHERE (type IS NULL AND name IS NULL)\nOR type in ('residential', 'apartments', 'house', 'static_caravan', 'detached')\"\n\nbuildings <- st_read(\"data/gis_osm_buildings_a_free_1.gpkg\", query = query, quiet = TRUE)\nbuildings <- buildings %>%\n  st_transform(3083)\n\n\n\nRead in census tract data\nRead in both geometries and income data\nExtract median income field and GEOID field from acs_income\nJoin the datasets\nProject the joined dataset to NAD 83\nProject Houston bounding box to NAD 83\nCrop the joined data to the Houston bounding box\n\n\nshow\n\nacs_geoms <- st_read(\"data/ACS_2019_5YR_TRACT_48_TEXAS.gdb\",\n                     layer = \"ACS_2019_5YR_TRACT_48_TEXAS\",\n                     quiet = TRUE)\nacs_income <- st_read(\"data/ACS_2019_5YR_TRACT_48_TEXAS.gdb\",\n                      layer = \"X19_INCOME\", \n                      quiet = TRUE)\n\nmedian_income <- acs_income[c(\"GEOID\", \"B19013e1\")]\ngeo_id <- acs_income[c(\"GEOID\")]\n\ngeoms_income <- left_join(acs_geoms, acs_income, by = c(\"GEOID_Data\" = \"GEOID\"))\ngeoms_income <- geoms_income %>%\n  st_transform(3083)\n\nhouston <- houston %>%\n  st_transform(3083)\n\ngeoms_income_cropped <- geoms_income[houston, op = st_intersects]\n\n\n\nMerge the datasets\nRemove highway 200m buffer from the vectorized blackout mask of Houston so our area of interest ignores highways\n\n\nshow\n\nno_hwy <- st_difference(diff_cropped, hwy_buff_200m)\n\n\n\nQuestion 1: How many residential buildings were without power on 2021-02-16?\nUse spatial subsetting to find all residential buildings in the blackout areas\nCrop all residential buildings based on no_hwy (which is our area of interest)\nExtract the number of rows (aka the number of buildings that experienced a blackout )\n\n\nshow\n\nbuildings_blackout <- buildings[no_hwy, op = st_intersects]\nq1_ans <- nrow(buildings_blackout)\n\n\n\nThere were 157411 residential buildings without power on 2021-02-16.\nVisualize buildings where the blackout occurred\nCreated a map of residential buildings that experienced a blackout (res)\nAdded res on top of a base map of the Houston area\n\n\nshow\n\nres <- tm_shape(buildings_blackout) +\n  tm_borders()\n\npt1 <- st_point(c(-96.5, 29))\npt2 <- st_point(c(-96.5, 30.5))\npt3 <- st_point(c(-94.5, 30.5))\npt4 <- st_point(c(-94.5, 29))\ncoords <- list(rbind(pt1, pt2, pt3, pt4, pt1))\npolygon <- st_polygon(x = coords)\nhouston <- st_sfc(polygon, crs = \"EPSG:4326\")\n\nhouston_bbox <- st_bbox(houston)\nhouston_map <- osm.raster(houston_bbox)\n\ntm_shape(houston_map) +\ntm_rgb() + \nres\n\n\n\n\nFigure 3: Approximately 157,411 residential buildings in Houston, TX were affected by the February 2021 storm.\n\n\n\nshow\n\ntmap_save(filename = \"houston.jpg\", width = 8, height = 5, units = \"in\", dpi = 300)\n\nbb_geoms_income <- st_join(buildings_blackout, geoms_income,\n                           join = st_intersects,\n                           left = TRUE)\n\n\n\nConclusion\nIn conclusion, we identified 157411 residential buildings in Houston without power due to the severe February 2021 storms. While night lights intensity may just be one way to measure the impact of these events, this method illustrates the vast potential of remotely sensed data from sources such as the Visible Infrared Imaging Radiometer Suite (VIIRS) aboard the Suomi satellite.\nGitHub\nFull code for this assignment can be found here.\n\n\n\n",
    "preview": "posts/2021-10-24-eds223houston/houston.jpg",
    "last_modified": "2021-12-05T16:46:23-08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-07-eds223cartography/",
    "title": "Exploring basic cartography using `sf` and `tmap`",
    "description": "EDS 223: Spatial Analysis - Assignment 1",
    "author": [
      {
        "name": "Mia Forsline",
        "url": {}
      }
    ],
    "date": "2021-10-07",
    "categories": [],
    "contents": "\n\nContents\nLearning Goals:\nLoad necessary packages\nLoad, subset, and explore Asia data from spData world data\nSpecify class intervals\nAdd a graticule if necessary\nHistogram of gdpPercap to choose breaks style\nPlot finished Asia map\nGitHub\n\nLearning Goals:\nLearn the basics of map design\nLearn how to load geospatial data\nLearn how to inspect geospatial data\nPlot geospatial data\nLoad necessary packages\n\n\nshow\n\nknitr::opts_chunk$set(echo = TRUE, \n                      message = FALSE,\n                      warning = FALSE,\n                      include = TRUE)\n\nlibrary(RColorBrewer)\nlibrary(sf)\nlibrary(spData)\nlibrary(spDataLarge)\nlibrary(tidyverse)\nlibrary(tmap)\nlibrary(dplyr)\n\n#display.brewer.all(colorblindFriendly = T) to view color-blind friendly palettes \n\n\n\nLoad, subset, and explore Asia data from spData world data\n\n\nshow\n\nworld_asia <- world[world[[\"continent\"]] == \"Asia\", ]\n\nplot(world_asia, max.plot = 10) #multi-plot of all attributes\n\n\n\nshow\n\nplot(world_asia[\"gdpPercap\"], #plot a specific attribute \n     key.pos = 4) #set the color key position (1=below, 2=left, 3=above and 4=right):\n\n\n\nshow\n\nplot(world_asia[\"gdpPercap\"], \n     key.pos = 1, \n     axes = TRUE, #add latitude/longitude tick marks \n     key.width = lcm(1.3), \n     key.length = 1.0)\n\n\n\n\nSpecify class intervals\n\n\nshow\n\nplot(world_asia[\"gdpPercap\"], nbreaks = 10)\n\n\n\nshow\n\n#nbreaks specifies the number of breaks\n#breaks uses a vector to specify break values or the break style \nplot(world_asia[\"gdpPercap\"], breaks = \"jenks\")\n\n\n\n\nAdd a graticule if necessary\n\n\nshow\n\nplot(world_asia[\"gdpPercap\"], graticule = TRUE, key.pos = NULL, axes = TRUE)\n\n\n\n\nHistogram of gdpPercap to choose breaks style\nboxplot to visualize data spread\n\n\nshow\n\nclass(world_asia$gdpPercap) #numeric class = continuous numeric variable \n\n\n[1] \"numeric\"\n\nshow\n\n#create a histogram, which shows a long right tail and strong skew \ngraphics::hist(world_asia$gdpPercap, \n     breaks = 10)\n\n\n\n\nPlot finished Asia map\n\n\nshow\n\n#create new bounding box \nbbox_new <- st_bbox(c(xmin = 26.04335, xmax = 145.5431,\n                      ymin = -15, ymax = 55.38525 )) # current bounding box\nxrange <- bbox_new$xmax - bbox_new$xmin # range of x values\nyrange <- bbox_new$ymax - bbox_new$ymin # range of y values\nbbox_new <- bbox_new %>%  \n  st_as_sfc()\n\n#plot \nasia_map <- tm_shape(world, bbox = bbox_new)+\n  tm_fill(col = \"white\") + \n  tm_borders(lwd = 0.1) + \ntm_shape(world_asia) +\n  tm_borders(lwd = 0.5) +\n  tm_fill(col = \"gdpPercap\", \n          palette = \"YlOrRd\", \n          style = \"order\",\n          title = \"GDP Per Capita\",\n          textNA = \"Missing Data\",\n          colorNA = \"gray\") +\n  tm_compass(type = \"4star\", \n             position = c(0.25,0.02), \n             size = 4, \n             show.labels = 2) + #show all 4 directions on the compass, not just N \n  #compass types: arrow, 4star, 8star, radar, rose\n  tm_scale_bar(breaks = c(0, 500, 1000, 1500, 2000), \n               text.size = 1, \n               position = c(\"center\", \"bottom\")) + \n  tm_text(text = \"name_long\", \n          size = 0.7, \n          col = \"black\") + \n  tm_layout(scale = 0.6, #zoom in and out \n            frame.lwd = 5,\n            legend.text.size = 1,\n            legend.title.size = 1.5, \n            legend.position = c(\"left\", \"bottom\"),\n            legend.bg.color = \"white\",\n            legend.frame = \"black\", \n            title.size = 2,\n            title.position = c(\"center\", \"top\"), \n            main.title = \"2014 GDP Per Capita in Asia\",\n            main.title.position = \"center\") +\n  tmap_options(bg.color = \"lightblue1\") + \n  tm_credits(paste(\"2014 GDP per capita for 43 countries in Asia. The mean per-capita GDP \\n was $20,026 (SD = 24,361; SE = 3,715). Original data is plotted in \\n WGS84 and sourced from 'spData' (https://nowosad.github.io/spData/).\"), \n             size = 0.8,\n             position=c(\"RIGHT\", \"BOTTOM\"),\n             bg.color = \"white\", \n             bg.alpha = 0.5)\nasia_map\n\n\n\n\nFigure 1: This map displays 2014 GDP per capita for 43 countries in Asia. 4 countries were omitted due to mising data: the Democratic People’s Republic of Korea, Northern Cyprus, Syria, and Taiwan. The maximum per-capita GDP is $120,860 in Qatar, and the minimum per-capita GDP is $1,839 in Afghanistan. The mean per-capita GDP is $20,026, and the median per-capita GDP is $10,650 (SD = 24,361; SE = 3,715). Only 4 countries measured per-capita GDP above $50,000. Per-capita GDP is rounded to the nearest whole number. Original world country polygon data is plotted in WGS84 and sourced from spData.\n\n\n\nshow\n\n#tmap_save(filename = \"asiamap_order.jpg\", width = 8, height = 5, units = \"in\", dpi = 300)\n\n\n\nGitHub\nFull code for this assignment can be found here.\n\n\n\n",
    "preview": "posts/2021-10-07-eds223cartography/asiamap.jpg",
    "last_modified": "2021-12-05T16:05:28-08:00",
    "input_file": {}
  }
]
